//
//  Constants.swift
//  AssociationsGame
//
//  Created by Илья Билтуев on 31.03.2022.
//

import Foundation

class Constants {
    static let associations: [String: [String: Int]] = [
        "адвокат": ["суд": 84, "юрист": 68, "защита": 42, "дьявола": 41, "прокурор": 24, "защитник": 23, "правосудие": 12],
        
        "армия": ["солдат": 40, "война": 29, "служба": 28, "дедовщина": 11, "сапоги, долг": 7, "дембель": 3, "камуфляж": 1],
        
        "жизнь": ["смерть": 75, "прекрасна": 46, "счастье": 21, "долгая, хороша": 9, "время, прекрасная": 7, "счастливая": 6, "без забот, единственная": 3],
        
        "журнал": ["газета": 50, "глянец": 36, "глянцевый": 29, "читать": 21, "классный": 13, "бумага, статья": 6, "модный, мода, пресса": 5],
        
        "зависть": ["плохо": 50, "черная": 43, "белая, чувство": 24, "злость": 18, "порок": 14, "богов, корысть": 8, "не порок, нельзя, неприязнь, сильная, чужая": 2],
        
        "звезда": ["небо": 88, "солнце": 75, "яркая": 44, "на небе": 25, "космос": 17, "по имени Солнце": 11, "в небе, планета": 10],
        
        "отец": ["мать": 102, "папа": 59, "родной": 42, "сын": 21, "мой": 13, "семья": 12, "дом, родитель, строгий": 10],
    
        "работа": ["деньги": 52, "труд": 46, "не волк": 35, "тяжелая": 19, "трудная": 13, "зарплата, учеба": 10, "дело, интересная, любимая, усталость": 9],
    
        "результат": ["итог": 81, "отличный, хороший": 24, "положительный": 16, "работы": 14, "конец": 13, "ответ, теста": 12, "вывод": 7],
    
        "религия": ["вера": 122, "христианство": 70, "бог": 36, "церковь": 21, "ислам": 15, "библия, крест": 9, "буддизм, мировая": 8],
        
        "угроза": ["жизни": 102, "опасность": 74, "страх": 50, "войны": 13, "нападения": 11, "нападение": 9, "здоровью, нависла, враг": 3],
        
        "улица": ["фонарь": 61, "дом": 36, "город": 29, "дорога": 25, "проспект": 17, "широкая": 15, "родная, моя, гулять": 3],
        
        "урожай": ["богатый": 36, "хороший": 32, "хлеб": 25, "пшеница": 22, "зерно, овощи, рожь": 18, "большой, собирать": 15, "осень, еда": 14],
        
        "фамилия": ["имя": 177, "моя": 54, "семья": 22, "род": 15, "отчество": 14, "девичья": 12, "красивая, паспорт, инициалы": 6],
        
        "хаос": ["беспорядок": 90, "бардак": 21, "беспредел": 16, "разруха, ужас": 13, "война, вселенная": 10, "неразбериха, страх": 4, "вселенский, дома, доктор, жизнь, конец света, тьма": 1],
    ]
}
